make intractive all required (md) files
